# Ch04.2 Handling Duplicated Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.__version__

'1.20.1'

In [3]:
pd.__version__

'1.2.3'

### Operating on Duplicated data

In [4]:
students = [('Jack', 34, 'Sydeny'),
            ('Riti', 30, 'Delhi'),
            ('Aadi', 16, 'New York'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Mumbai'),
            ('Aadi', 40, 'London'),
            ('Sachin', 30, 'Delhi')
            ]
 
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])

In [5]:
df

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30     Delhi
4    Riti   30     Delhi
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [6]:
# check if any records are duplicates
df.duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [7]:
df.duplicated().any()

True

In [8]:
df.duplicated().values.any()

True

In [9]:
# list duplicated records
df[df.duplicated()]

   Name  Age   City
3  Riti   30  Delhi
4  Riti   30  Delhi

In [10]:
# check duplicates in a particular column
df.duplicated(subset='City')

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7     True
dtype: bool

In [11]:
# check duplicates in some columns
df.duplicated(subset=['Name','City'])

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

Alternatively, you can add ‘keep’ and indicate
whether you’d like to keep:
* keep='first', keep the first argumen(default)
* keep='last', keep the last argument
* keep=False, drop all the duplicates

In [12]:
# remove duplicated rows
df.drop_duplicates()

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [13]:
# drop duplicates from column
df.drop_duplicates(subset=['Age','City'])

   Name  Age      City
0  Jack   34    Sydeny
1  Riti   30     Delhi
2  Aadi   16  New York
5  Riti   30    Mumbai
6  Aadi   40    London